"""
List

예시)
a = [1, 2, 3]
b = [4, 5, 6]

1. list 특성
1) 초기화 : a = list()  -> a = []
          a = [0] * 7 -> a = [0, 0, 0, 0, 0, 0, 0]
2) 더하기: a + b = [1, 2, 3, 4, 5, 6]
         a.append([4, 5])   # [1, 2, 3, [4, 5]]
         a.extend([4, 5])   # [1, 2, 3, 4, 5]
3) 삽입: a.insert(0, 4)  # [4, 1, 2, 3]
4) 수정: a[2] = 4  # a = [1, 2, 3]
5) 삭제: del a[1]  # a = [1, 3]
        del a[1:] # a = [1]
6) 길이: len(a) = 3
7) 정렬: a.sort()  # 오름차순 정렬하여 저장됨
        a.sort(reverse=True)  # 내림차순 정렬하여 저장됨
        c = sorted(a)  # 오름차순 정렬
8) 개수: a.count(1)  # 1의 개수 세기

"""

a = list()
a.append(1)
print(a)
